#!/bin/sh
# 获取拓扑文件
echo -------------------***********************---------------------------
echo -------------------    获取拓扑文件       ---------------------------
echo -------------------***********************---------------------------
sleep 1s
gmx pdb2gmx -ignh -ff amber99sb-ildn -f fws.pdb -o fws.gro -p fws.top -water tip3p

echo -------------------***********************---------------------------
echo -------------------    创建模拟盒子       ---------------------------
echo -------------------***********************---------------------------
sleep 1s
gmx editconf -f fws.gro -o fws-PBC.gro -bt dodecahedron -d 1.2

echo -------------------***********************---------------------------
echo -------------------    能量最小化处理     ---------------------------
echo -------------------***********************---------------------------
sleep 1s
gmx grompp -f em-vac-pme.mdp -c fws-PBC.gro -p fws.top -o em-vac.tpr
gmx mdrun -v -deffnm em-vac

echo -------------------***********************---------------------------
echo -------------------    填充溶剂离子预处理 ---------------------------
echo -------------------***********************---------------------------
sleep 1s
gmx solvate -cp em-vac.gro -cs spc216.gro -p fws.top -o fws-b4ion.gro
gmx grompp -f em-sol-pme.mdp -c fws-b4ion.gro -p fws.top -o ion.tpr
